#Задание 1
phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'

if len(phrase_1) > len(phrase_2):
    print('Фраза 1 длиннее фразы 2')
elif len(phrase_1) == len(phrase_2):
    print('Фразы равной длины')
else:
    print('Фраза 2 длиннее фразы 1')

#Задание 2
n = int(input())

if (n%4==0 and n%100!=0) or n%400==0:
    print('Високосный год')
else:
    print('Обычный год')

#Задание 3
d = int(input('Введите день'))
m = int(input('Введите месяц'))

if (21<=d<=31 and m ==3) or (1<=d<=20 and m==4):
    print('Ваш знак зодиака: Овен')
elif (21<=d<=30 and m ==4) or (1<=d<=21 and m==5):
    print('Ваш знак зодиака: Телец')
elif (22<=d<=31 and m ==5) or (1<=d<=21 and m==6):
    print('Ваш знак зодиака: Близнецы')
elif (22<=d<=30 and m ==6) or (1<=d<=22 and m==7):
    print('Ваш знак зодиака: Рак')
elif (23<=d<=31 and m ==7) or (1<=d<=23 and m==8):
    print('Ваш знак зодиака: Лев')
elif (24<=d<=31 and m ==8) or (1<=d<=22 and m==9):
    print('Ваш знак зодиака: Дева')   
elif (23<=d<=30 and m ==9) or (1<=d<=23 and m==10):
    print('Ваш знак зодиака: Весы')  
elif (24<=d<=31 and m ==10) or (1<=d<=22 and m==11):
    print('Ваш знак зодиака: Скорпион')
elif (23<=d<=30 and m ==11) or (1<=d<=21 and m==12): 
    print('Ваш знак зодиака: Стрелец')  
elif (2<=d<=31 and m ==12) or (1<=d<=20 and m==1): 
    print('Ваш знак зодиака: Козерог')  
elif (21<=d<=31 and m ==1) or (1<=d<=18 and m==2): 
    print('Ваш знак зодиака: Водолей')
elif (19<=d<=29 and m ==2) or (1<=d<=20 and m==3):
    print('Ваш знак зодиака: Рыбы')
else:
    print('Некорректные данные')

#Задание 4
a = int(input())
b = int(input())
c = int(input())

if a <= 15 and b <= 15 and c <= 15:
    print('Коробка №1')
elif 15 < a < 50 or 15 < b < 50 or 15 < c < 50:
    print('Коробка №2')
elif a > 200 or b > 200 or c > 200:
    print('Упаковка для лыж')
else:
    print('Коробка №3')

#Задание 5
n = int(input())

if (n%10 + n//10%10 + n//100%10) == (n//100000 + n//10000%10 + n//1000%10):
    print('Счастливый билет')
else:
    print('Несчастливый билет')

#Задание 6
from math import sqrt, pi
f = int(input('Введи тип фигуры: Круг - 1, Треугольник - 2, Прямоугольник - 3. Ваш выбор = '))

if f == 1:
    r = int(input('Введи радиус = '))
    if r > 0:
        print('Площадь круга =', pi*r**2)
    else:
        print('Круг с таким радиусом не существет')
elif f == 2:
    a, b, c = int(input('Введи сторону 1 = ')), int(input('Введи сторону 2 = ')), int(input('Введи сторону 3 = '))
    if a + b > c and a + c > b and c + b > a and a > 0 and b > 0 and c > 0:
        print('Площадь треугольника =', round(sqrt((a+b+c)/2*(a-b+c)/2*(a+b-c)/2*(-a+b+c)/2), 2))
    else:
        print('Треугольник с такими сторонами не существует')
elif f == 3:
    a, b = int(input('Введи сторону 1 = ')), int(input('Введи сторону 2 = '))
    if a > 0 and b > 0:
        print('Площадь прямоугольника =', a*b)
    else:
        print('Прямоугольник с такими сторонами не существет')
else:
    print('Некорректные данные')

